jeremysalwen/Mowgli/stm32/ros_usbnode/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 1.0.0
 * @brief   main / bootup and initialization, motor control routines, usb init
 ******************************************************************************
 *
 * compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
 *
 * ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
 *
 ******************************************************************************
 */

#include <stdio.h>
#include <stdbool.h>
#include <stdarg.h>
#include <math.h>
#include <string.h>
#include "stm32f_board_hal.h"
#include "main.h"
// stm32 custom
#include "board.h"
#include "panel.h"
#include "panel.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "emergency.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "ultrasonic_sensor.h"
#include "perimeter.h"
#include "adc.h"
#include "charger.h"
#include "soft_i2c.h"
#include "i2c.h"
#include "imu/imu.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

#if defined(DEBUG_RTT)
#include "SEGGER_RTT.h"
#endif

static void WATCHDOG_vInit(void);
static void WATCHDOG_Refresh(void);
void TIM4_Init(void);
void HALLSTOP_Sensor_Init(void);

static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;
static nbt_t main_emergency_nbt;
static nbt_t main_blademotor_nbt;
static nbt_t main_drivemotor_nbt;
static nbt_t main_wdg_nbt;
static nbt_t main_buzzer_nbt;
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
static nbt_t main_ultrasonicsensor_nbt;
#endif
#if BOARD_HAS_MASTER_USART
volatile uint8_t master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];
#endif

uint8_t do_chirp_duration_counter;
uint8_t do_chirp = 0;

openmower_status_e main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;

#if BOARD_YARDFORCE500_VARIANT_ORIG
UART_HandleTypeDef MASTER_USART_Handler; // UART  Handle
#endif

// Drive Motors DMA
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;
TIM_HandleTypeDef TIM3_Handle; // PWM Beeper
TIM_HandleTypeDef TIM4_Handle; // PWM Buzzer
IWDG_HandleTypeDef IwdgHandle = {0};
WWDG_HandleTypeDef WwdgHandle = {0};

#if DB_ACTIVE
int debug_assert(int condition, const char *msg)
{
  if (condition){
    return 0;
  }
  debug_printf(msg);
  return 1;
}
#endif

#ifdef BLADE_REVERSE_SELFTEST
/* ---------------------------------------------------------------------------
 * Blade reverse bench self-test.
 *
 * Auto-cycles the blade  OFF -> FORWARD -> OFF -> REVERSE  and records the
 * blade controller's response into g_blade_test so the reverse fix can be
 * verified on the bench WITHOUT a ROS host. Read it over SWD, e.g.:
 *     mdw &g_blade_test 11
 * Drive motors are hard-disabled (PAC5210 held in reset, see drivemotor.c),
 * so the WHEELS CANNOT MOVE during this test.
 * ------------------------------------------------------------------------- */
typedef struct {
    uint32_t magic;      /* 0xB1ADE7E5 - marker so the SWD reader finds it    */
    uint32_t heartbeat;  /* ++ every 100ms blade cycle (liveness)            */
    uint32_t phase;      /* 0=OFF 1=FORWARD 2=OFF 3=REVERSE                   */
    uint32_t on_off;     /* command issued this cycle                        */
    uint32_t direction;  /* command issued this cycle (1 = reverse)          */
    uint32_t cmd_byte5;  /* request byte[5] commanded (0x00/0x80/0xC0)       */
    uint32_t activated;  /* BLADEMOTOR_bActivated - controller reports ON    */
    uint32_t rpm;        /* BLADEMOTOR_u16RPM   (controller-reported)        */
    uint32_t power;      /* BLADEMOTOR_u16Power (controller-reported)        */
    uint32_t errcount;   /* BLADEMOTOR_u32Error (++ when controller errors)  */
    uint32_t phase_ms;   /* ms elapsed in the current phase                  */
} blade_test_t;

volatile blade_test_t g_blade_test = { 0xB1ADE7E5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

static void blade_selftest_step(void)
{
    static const uint32_t dur[4] = { 3000u, 5000u, 3000u, 5000u };
    static uint32_t phase = 0;
    static uint32_t phase_start = 0;
    uint32_t now = HAL_GetTick();
    uint32_t elapsed;

    if (phase_start == 0) phase_start = now;
    elapsed = now - phase_start;
    if (elapsed >= dur[phase])
    {
        phase = (phase + 1u) & 3u;
        phase_start = now;
        elapsed = 0;
    }

    uint8_t on_off    = (phase == 1u || phase == 3u) ? 1u : 0u;
    uint8_t direction = (phase == 3u) ? 1u : 0u;   /* phase 3 = REVERSE */
    BLADEMOTOR_Set(on_off, direction);

    g_blade_test.heartbeat++;
    g_blade_test.phase     = phase;
    g_blade_test.on_off    = on_off;
    g_blade_test.direction = direction;
    g_blade_test.cmd_byte5 = on_off ? (direction ? 0xC0u : 0x80u) : 0x00u;
    g_blade_test.activated = BLADEMOTOR_bActivated ? 1u : 0u;
    g_blade_test.rpm       = BLADEMOTOR_u16RPM;
    g_blade_test.power     = BLADEMOTOR_u16Power;
    g_blade_test.errcount  = BLADEMOTOR_u32Error;
    g_blade_test.phase_ms  = elapsed;
}
#endif /* BLADE_REVERSE_SELFTEST */

int main(void)
{

  HAL_Init();
  SystemClock_Config();

#if BOARD_YARDFORCE500_VARIANT_ORIG
  __HAL_RCC_AFIO_CLK_ENABLE();
  __HAL_RCC_PWR_CLK_ENABLE();
#endif

  MX_DMA_Init();

#if BOARD_HAS_MASTER_USART
  // Init debug USART
  MASTER_USART_Init();
#endif

  DB_TRACE("\r\n");
  DB_TRACE("    __  ___                    ___\r\n");
  DB_TRACE("   /  |/  /___ _      ______ _/ (_)\r\n");
  DB_TRACE("  / /|_/ / __ \\ | /| / / __ `/ / / \r\n");
  DB_TRACE(" / /  / / /_/ / |/ |/ / /_/ / / /  \r\n");
  DB_TRACE("/_/  /_/\\____/|__/|__/\\__, /_/_/   \r\n");
  DB_TRACE("                     /____/        \r\n");
  DB_TRACE("\r\n\r\n");
  DB_TRACE(" * Master USART (debug) initialized\r\n");
  LED_Init();
  DB_TRACE(" * LED initialized\r\n");
  TIM2_Init();
  ADC_Charging_Init();
#ifdef OPTION_PERIMETER
  Perimeter_vInit();
#endif
  DB_TRACE(" * Charging ADC initialized\r\n");
  TIM3_Init();
  HAL_TIM_PWM_Start(&TIM3_Handle, TIM_CHANNEL_4);
  TIM4_Init();
  HAL_TIM_PWM_Start(&TIM4_Handle, TIM_CHANNEL_3);
  DB_TRACE(" * Timer3 (Beeper) initialized\r\n");
  TF4_Init();
  DB_TRACE(" * 24V switched on\r\n");
  RAIN_Sensor_Init();
  DB_TRACE(" * RAIN Sensor enabled\r\n");
  HALLSTOP_Sensor_Init();
  DB_TRACE(" * HALL Sensor enabled\r\n");

  I2C_Init();
  DB_TRACE(" * Hard I2C initialized\r\n");
  if (I2C_Acclerometer_TestDevice())
  {
    I2C_Accelerometer_Setup();
  }
  else
  {
    chirp(3);
    DB_TRACE("\e[01;31m * WARNING: initalization of onboard accelerometer for tilt protection failed !\e[0m\r\n");
  }

  DB_TRACE(" * Accelerometer (onboard/tilt safety) initialized\r\n");
  SW_I2C_Init();
  DB_TRACE(" * Soft I2C (J18) initialized\r\n");
  DB_TRACE(" * Testing supported IMUs:\r\n");
  IMU_Init();
  IMU_CalibrateExternal();
  PANEL_Init();
  DB_TRACE(" * Panel initialized\r\n");
  Emergency_Init();
  DB_TRACE(" * Emergency sensors initialized\r\n");
  TIM1_Init();
  DB_TRACE(" * Timer1 (Charge PWM) initialized\r\n");
  MX_USB_DEVICE_Init();
  DB_TRACE(" * USB CDC initialized\r\n");
// Init Drive Motors and Blade Motor
#ifdef DRIVEMOTORS_USART_ENABLED
  DRIVEMOTOR_Init();
  DB_TRACE(" * Drive Motors USART initialized\r\n");
#endif
#ifdef BLADEMOTOR_USART_ENABLED
  BLADEMOTOR_Init();
#endif
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
  ULTRASONICSENSOR_Init();
#endif

  HAL_GPIO_WritePin(LED_GPIO_PORT, LED_PIN, 0);
  HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 1);

  // Initialize Main Timers
  NBT_init(&main_chargecontroller_nbt, 10);
  NBT_init(&main_statusled_nbt, 1000);
  NBT_init(&main_emergency_nbt, 10);
#if (DEBUG_TYPE != DEBUG_TYPE_UART) && (OPTION_ULTRASONIC == 1)
  NBT_init(&main_ultrasonicsensor_nbt, 50);
#endif
  NBT_init(&main_blademotor_nbt, 100);
  NBT_init(&main_drivemotor_nbt, 20);
  NBT_init(&main_wdg_nbt, 10);
  NBT_init(&main_buzzer_nbt, 200);

  DB_TRACE(" * NBT Main timers initialized\r\n");

#ifdef I_DONT_NEED_MY_FINGERS
  DB_TRACE("\r\n\e[01;31m");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE("   EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
  DB_TRACE("=========================================================\r\n");
  DB_TRACE("\e[0m\r\n");
#endif
  // Initialize ROS
  init_ROS();
  DB_TRACE(" * ROS serial node initialized\r\n");
  DB_TRACE("\r\n\e[01;36m >>> entering main loop ...\e[0m\r\n\r\n");
  // <chirp><chirp> means we are in the main loop
  chirp(2);

  WATCHDOG_vInit();

  while (1)
  {
    chatter_handler();
    motors_handler();
    panel_handler();
    spinOnce();
    broadcast_handler();

    DRIVEMOTOR_App_Rx();
#ifdef OPTION_PERIMETER
    Perimeter_vApp();
#endif

    if (NBT_handler(&main_chargecontroller_nbt))
    {
      ADC_input();
      ChargeController();
    }
    if (NBT_handler(&main_statusled_nbt))
    {
      StatusLEDUpdate();

